```terraform
[command]/home/runner/work/_temp/ddfec7a5-1d7e-4a53-8a6d-5c4eaa930d8f/terraform-bin plan -out=environment.tfplan -no-color
module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]
module.vpc.data.aws_security_group.ec2_public[0]: Reading...
module.vpc.data.aws_security_group.rds_postgres_insecure[0]: Reading...
module.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]
module.vpc.data.aws_subnet.public_2[0]: Reading...
module.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]
module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]
module.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]
module.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]
module.vpc.data.aws_subnet.private_1[0]: Reading...
module.vpc.data.aws_subnet.public_1[0]: Reading...
module.vpc.data.aws_vpc.default: Reading...
module.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue]
module.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]
module.vpc.data.aws_security_group.rds_postgres_secure[0]: Reading...
module.vpc.data.aws_subnet.private_2[0]: Reading...
module.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]
module.vpc.data.aws_security_group.ec2_public[0]: Read complete after 0s [id=sg-0049f561f6149005e]
module.vpc.data.aws_security_group.rds_postgres_secure[0]: Read complete after 0s [id=sg-00d8df4b18c6781f4]
module.iam.data.aws_iam_role.lambda_role[0]: Reading...
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]
module.vpc.data.aws_security_group.rds_postgres_insecure[0]: Read complete after 0s [id=sg-0e0df8ed3aa2e4ecf]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]
module.vpc.data.aws_subnet.public_2[0]: Read complete after 0s [id=subnet-0e6363cd41b9abd3a]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]
module.vpc.data.aws_subnet.public_1[0]: Read complete after 0s [id=subnet-0f27534c3a493385e]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]
module.vpc.data.aws_subnet.private_1[0]: Read complete after 0s [id=subnet-06383153ba9f3fde3]
module.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]
module.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]
module.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]
module.vpc.data.aws_subnet.private_2[0]: Read complete after 0s [id=subnet-018110fcdfaa13ea2]
module.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]
module.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]
module.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]
module.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]
module.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]
module.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-QDNBQA3GMWJ5L4VRFGEOQFO6EY]
module.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]
module.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]
module.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.sqs.aws_ssm_parameter.question_generation_processor_queue_arn will be created
  + resource "aws_ssm_parameter" "question_generation_processor_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/sqs/question_generation_processor_queue_arn"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.sqs.aws_ssm_parameter.question_generation_processor_queue_url will be created
  + resource "aws_ssm_parameter" "question_generation_processor_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/sqs/question_generation_processor_queue_url"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Error: describing SSM parameter (/terraform/staging/api_gateway/id): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:DescribeParameters on resource: arn:aws:ssm:us-east-1:791901361445:* because no identity-based policy allows the ssm:DescribeParameters action
	status code: 400, request id: eb02930c-3e1d-44fc-a51d-392756118085

  with module.apigateway.aws_ssm_parameter.api_gateway_id,
  on modules/apigateway/ssm.tf line 1, in resource "aws_ssm_parameter" "api_gateway_id":
   1: resource "aws_ssm_parameter" "api_gateway_id" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/api_gateway/root_resource_id): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/api_gateway/root_resource_id because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: 4d501e55-c266-421f-ab15-e6c470e6febd

  with module.apigateway.aws_ssm_parameter.api_gateway_root_resource_id,
  on modules/apigateway/ssm.tf line 7, in resource "aws_ssm_parameter" "api_gateway_root_resource_id":
   7: resource "aws_ssm_parameter" "api_gateway_root_resource_id" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/endpoint): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/endpoint because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: 1edad4f7-2270-4ac7-9704-ab3341490f8e

  with module.rds.aws_ssm_parameter.db_instance_endpoint,
  on modules/rds/ssm.tf line 1, in resource "aws_ssm_parameter" "db_instance_endpoint":
   1: resource "aws_ssm_parameter" "db_instance_endpoint" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/db_name): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/db_name because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: 0608f541-77d0-4bee-8e63-77306b6465ef

  with module.rds.aws_ssm_parameter.db_instance_name,
  on modules/rds/ssm.tf line 7, in resource "aws_ssm_parameter" "db_instance_name":
   7: resource "aws_ssm_parameter" "db_instance_name" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/port): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/port because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: f0ea4f4f-b725-41ad-a9ba-f587c1a596d2

  with module.rds.aws_ssm_parameter.db_instance_port,
  on modules/rds/ssm.tf line 13, in resource "aws_ssm_parameter" "db_instance_port":
  13: resource "aws_ssm_parameter" "db_instance_port" {


Error: describing SSM parameter (/terraform/staging/rds/db_password): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:DescribeParameters on resource: arn:aws:ssm:us-east-1:791901361445:* because no identity-based policy allows the ssm:DescribeParameters action
	status code: 400, request id: 8482091d-5a88-4a62-aa83-783bc86bc047

  with module.rds.aws_ssm_parameter.db_instance_password,
  on modules/rds/ssm.tf line 19, in resource "aws_ssm_parameter" "db_instance_password":
  19: resource "aws_ssm_parameter" "db_instance_password" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/db_username): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/db_username because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: de7916cc-9d66-4551-bc6b-8a27f11186b5

  with module.rds.aws_ssm_parameter.db_instance_username,
  on modules/rds/ssm.tf line 25, in resource "aws_ssm_parameter" "db_instance_username":
  25: resource "aws_ssm_parameter" "db_instance_username" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/sqs/checklist_generation_processor_queue_arn): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_generation_processor_queue_arn because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: 85159a98-f0ed-4032-8400-767195dfd4fa

  with module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn,
  on modules/sqs/ssm.tf line 1, in resource "aws_ssm_parameter" "checklist_generation_processor_queue_arn":
   1: resource "aws_ssm_parameter" "checklist_generation_processor_queue_arn" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/sqs/checklist_generation_processor_queue_url): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_generation_processor_queue_url because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: 8afac400-5f02-4523-b22e-5a1b5bcba7bd

  with module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url,
  on modules/sqs/ssm.tf line 7, in resource "aws_ssm_parameter" "checklist_generation_processor_queue_url":
   7: resource "aws_ssm_parameter" "checklist_generation_processor_queue_url" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/sqs/checklist_evaluation_processor_queue_arn): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_evaluation_processor_queue_arn because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: 670831bc-b48f-45bc-84e5-d270b129e282

  with module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn,
  on modules/sqs/ssm.tf line 13, in resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_arn":
  13: resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_arn" {


Error: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/sqs/checklist_evaluation_processor_queue_url): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_evaluation_processor_queue_url because no identity-based policy allows the ssm:ListTagsForResource action
	status code: 400, request id: 31b3597e-39ff-4afb-8f76-82ea52526d8e

  with module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url,
  on modules/sqs/ssm.tf line 19, in resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_url":
  19: resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_url" {

::debug::Terraform exited with code 1.
::debug::stdout: module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]%0Amodule.vpc.data.aws_security_group.ec2_public[0]: Reading...%0Amodule.vpc.data.aws_security_group.rds_postgres_insecure[0]: Reading...%0Amodule.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]%0Amodule.vpc.data.aws_subnet.public_2[0]: Reading...%0Amodule.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]%0Amodule.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]%0Amodule.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]%0Amodule.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]%0Amodule.vpc.data.aws_subnet.private_1[0]: Reading...%0Amodule.vpc.data.aws_subnet.public_1[0]: Reading...%0Amodule.vpc.data.aws_vpc.default: Reading...%0Amodule.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue]%0Amodule.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]%0Amodule.vpc.data.aws_security_group.rds_postgres_secure[0]: Reading...%0Amodule.vpc.data.aws_subnet.private_2[0]: Reading...%0Amodule.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]%0Amodule.vpc.data.aws_security_group.ec2_public[0]: Read complete after 0s [id=sg-0049f561f6149005e]%0Amodule.vpc.data.aws_security_group.rds_postgres_secure[0]: Read complete after 0s [id=sg-00d8df4b18c6781f4]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Reading...%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]%0Amodule.vpc.data.aws_security_group.rds_postgres_insecure[0]: Read complete after 0s [id=sg-0e0df8ed3aa2e4ecf]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]%0Amodule.vpc.data.aws_subnet.public_2[0]: Read complete after 0s [id=subnet-0e6363cd41b9abd3a]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]%0Amodule.vpc.data.aws_subnet.public_1[0]: Read complete after 0s [id=subnet-0f27534c3a493385e]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]%0Amodule.vpc.data.aws_subnet.private_1[0]: Read complete after 0s [id=subnet-06383153ba9f3fde3]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]%0Amodule.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]%0Amodule.vpc.data.aws_subnet.private_2[0]: Read complete after 0s [id=subnet-018110fcdfaa13ea2]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]%0Amodule.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]%0Amodule.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]%0Amodule.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-QDNBQA3GMWJ5L4VRFGEOQFO6EY]%0Amodule.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]%0Amodule.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]%0Amodule.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform planned the following actions, but then encountered a problem:%0A%0A  # module.sqs.aws_ssm_parameter.question_generation_processor_queue_arn will be created%0A  + resource "aws_ssm_parameter" "question_generation_processor_queue_arn" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/sqs/question_generation_processor_queue_arn"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0A  # module.sqs.aws_ssm_parameter.question_generation_processor_queue_url will be created%0A  + resource "aws_ssm_parameter" "question_generation_processor_queue_url" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/sqs/question_generation_processor_queue_url"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: %0AError: describing SSM parameter (/terraform/staging/api_gateway/id): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:DescribeParameters on resource: arn:aws:ssm:us-east-1:791901361445:* because no identity-based policy allows the ssm:DescribeParameters action%0A	status code: 400, request id: eb02930c-3e1d-44fc-a51d-392756118085%0A%0A  with module.apigateway.aws_ssm_parameter.api_gateway_id,%0A  on modules/apigateway/ssm.tf line 1, in resource "aws_ssm_parameter" "api_gateway_id":%0A   1: resource "aws_ssm_parameter" "api_gateway_id" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/api_gateway/root_resource_id): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/api_gateway/root_resource_id because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: 4d501e55-c266-421f-ab15-e6c470e6febd%0A%0A  with module.apigateway.aws_ssm_parameter.api_gateway_root_resource_id,%0A  on modules/apigateway/ssm.tf line 7, in resource "aws_ssm_parameter" "api_gateway_root_resource_id":%0A   7: resource "aws_ssm_parameter" "api_gateway_root_resource_id" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/endpoint): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/endpoint because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: 1edad4f7-2270-4ac7-9704-ab3341490f8e%0A%0A  with module.rds.aws_ssm_parameter.db_instance_endpoint,%0A  on modules/rds/ssm.tf line 1, in resource "aws_ssm_parameter" "db_instance_endpoint":%0A   1: resource "aws_ssm_parameter" "db_instance_endpoint" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/db_name): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/db_name because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: 0608f541-77d0-4bee-8e63-77306b6465ef%0A%0A  with module.rds.aws_ssm_parameter.db_instance_name,%0A  on modules/rds/ssm.tf line 7, in resource "aws_ssm_parameter" "db_instance_name":%0A   7: resource "aws_ssm_parameter" "db_instance_name" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/port): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/port because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: f0ea4f4f-b725-41ad-a9ba-f587c1a596d2%0A%0A  with module.rds.aws_ssm_parameter.db_instance_port,%0A  on modules/rds/ssm.tf line 13, in resource "aws_ssm_parameter" "db_instance_port":%0A  13: resource "aws_ssm_parameter" "db_instance_port" {%0A%0A%0AError: describing SSM parameter (/terraform/staging/rds/db_password): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:DescribeParameters on resource: arn:aws:ssm:us-east-1:791901361445:* because no identity-based policy allows the ssm:DescribeParameters action%0A	status code: 400, request id: 8482091d-5a88-4a62-aa83-783bc86bc047%0A%0A  with module.rds.aws_ssm_parameter.db_instance_password,%0A  on modules/rds/ssm.tf line 19, in resource "aws_ssm_parameter" "db_instance_password":%0A  19: resource "aws_ssm_parameter" "db_instance_password" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/rds/db_username): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/db_username because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: de7916cc-9d66-4551-bc6b-8a27f11186b5%0A%0A  with module.rds.aws_ssm_parameter.db_instance_username,%0A  on modules/rds/ssm.tf line 25, in resource "aws_ssm_parameter" "db_instance_username":%0A  25: resource "aws_ssm_parameter" "db_instance_username" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/sqs/checklist_generation_processor_queue_arn): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_generation_processor_queue_arn because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: 85159a98-f0ed-4032-8400-767195dfd4fa%0A%0A  with module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn,%0A  on modules/sqs/ssm.tf line 1, in resource "aws_ssm_parameter" "checklist_generation_processor_queue_arn":%0A   1: resource "aws_ssm_parameter" "checklist_generation_processor_queue_arn" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/sqs/checklist_generation_processor_queue_url): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_generation_processor_queue_url because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: 8afac400-5f02-4523-b22e-5a1b5bcba7bd%0A%0A  with module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url,%0A  on modules/sqs/ssm.tf line 7, in resource "aws_ssm_parameter" "checklist_generation_processor_queue_url":%0A   7: resource "aws_ssm_parameter" "checklist_generation_processor_queue_url" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/sqs/checklist_evaluation_processor_queue_arn): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_evaluation_processor_queue_arn because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: 670831bc-b48f-45bc-84e5-d270b129e282%0A%0A  with module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn,%0A  on modules/sqs/ssm.tf line 13, in resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_arn":%0A  13: resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_arn" {%0A%0A%0AError: listing tags for SSM (Systems Manager) Parameter (/terraform/staging/sqs/checklist_evaluation_processor_queue_url): AccessDeniedException: User: arn:aws:iam::791901361445:user/github is not authorized to perform: ssm:ListTagsForResource on resource: arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_evaluation_processor_queue_url because no identity-based policy allows the ssm:ListTagsForResource action%0A	status code: 400, request id: 31b3597e-39ff-4afb-8f76-82ea52526d8e%0A%0A  with module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url,%0A  on modules/sqs/ssm.tf line 19, in resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_url":%0A  19: resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_url" {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.

```